In [1]:
import pandas as pd

In [2]:
student={
    "Name":["Apoorv","Aniruddha","Adhrit","Yugant","Vision"],
    "RollNo":[1,2,3,4,5],
    "Place":["islampur","Islampur","Pune","Pune","Earth"],
    "College":["Mit","Mit","Mit","iit","nit"]
}

In [3]:
df=pd.DataFrame(student)

In [4]:
df

        Name  RollNo     Place College
0     Apoorv       1  islampur     Mit
1  Aniruddha       2  Islampur     Mit
2     Adhrit       3      Pune     Mit
3     Yugant       4      Pune     iit
4     Vision       5     Earth     nit

In [5]:
filtplace=(df["Place"]=="Pune")

In [72]:
filtplace

0    False
1    False
2     True
3     True
4    False
Name: Place, dtype: bool

In [6]:
df.loc[filtplace]#only shows those rows which are true

     Name  RollNo Place College
2  Adhrit       3  Pune     Mit
3  Yugant       4  Pune     iit

In [7]:
df.loc[filtplace,"College" ]

2    Mit
3    iit
Name: College, dtype: object

In [8]:
df

        Name  RollNo     Place College
0     Apoorv       1  islampur     Mit
1  Aniruddha       2  Islampur     Mit
2     Adhrit       3      Pune     Mit
3     Yugant       4      Pune     iit
4     Vision       5     Earth     nit

In [190]:
df.RollNo[0]

1

In [11]:
filtcoll=((df["College"]=="Mit")&(df["Place"]=='Pune'))

In [12]:
df.loc[filtcoll]

     Name  RollNo Place College
2  Adhrit       3  Pune     Mit

In [88]:
df.loc[~filtcoll]  #filter negation

        Name  RollNo     Place College
0     Apoorv       1  islampur     Mit
1  Aniruddha       2  Islampur     Mit
3     Yugant       4      Pune     iit
4     Vision       5     Earth     nit

In [25]:
ft=(df.RollNo%2 != 0)

In [26]:
df.loc[ft]

     Name  RollNo     Place College
0  Apoorv       1  islampur     Mit
2  Adhrit       3      Pune     Mit
4  Vision       5     Earth     nit

In [27]:
ft1=((df["College"]=="Mit")&(ft))

In [30]:
df.loc[ft1,["Name","Place"]]

     Name     Place
0  Apoorv  islampur
2  Adhrit      Pune

In [31]:
df

        Name  RollNo     Place College
0     Apoorv       1  islampur     Mit
1  Aniruddha       2  Islampur     Mit
2     Adhrit       3      Pune     Mit
3     Yugant       4      Pune     iit
4     Vision       5     Earth     nit

In [34]:
ft2=df["Name"].str.contains("A")

In [35]:
df.loc[ft2]

        Name  RollNo     Place College
0     Apoorv       1  islampur     Mit
1  Aniruddha       2  Islampur     Mit
2     Adhrit       3      Pune     Mit